var strings = {
    weekdayAbbr: ['سبت', 'أحد', 'إثن', 'ثلا', 'إرب', 'خمي', 'جمع'],
    smallGregorianMonthNames: ['يناير', 'فبراير', 'مارس', 'أبريل', 'مايو', 'يونيو', 'يوليو', 'أغسطس', 'سبتمبر', 'أكتوبر', 'نوفمبر', 'ديسمبر'],
    largeGregorianMonthNames: ['يناير', 'فبراير', 'مارس', 'أبريل', 'مايو', 'يونيو', 'يوليو', 'أغسطس', 'سبتمبر', 'أكتوبر', 'نوفمبر', 'ديسمبر'],
    smallHijriMonthNames: ['محرّم', 'صفر', 'ربيع الأول', 'ربيع الثاني', 'جمادى الأولى', 'جمادى الثانية', 'رجب', 'شعبان', 'رمضان', 'شوال', 'ذو القعدة', 'ذو الحجة'],
    largeHijriMonthNames: ['محرّم', 'صفر', 'ربيع الأول', 'ربيع الثاني', 'جمادى الأولى', 'جمادى الثانية', 'رجب', 'شعبان', 'رمضان', 'شوال', 'ذو القعدة', 'ذو الحجة'],
    convertDate: 'تحويل التاريخ',
    fromGregorian: 'من الميلادي',
    fromHijri: 'من الهجري',
    year: 'سنة',
    month: 'شهر',
    day: 'يوم',
};

var metadata = {
    dir: 'rtl',
};
